# Περιλαμβάνουν <string.h> 
# include <stdio.h>
 
int κύριο ( )  
{ 
    const  char * εγχόρδων =  "Hello World!" ?
 
    / / Αγώνες 
    int ένα = strcmp ( εγχόρδων, "Hello World!" ) ? 
    εάν  ( α ==  0 )  { 
        printf ( "Strings ταιριάζουν. \ n " ) ? 
    }
 
    / / Μεγαλύτερη από ό, 
    int b = strcmp ( εγχόρδων, "Hello" ) ? 
    αν  ( β > =  1 )  { 
        printf ( "Αριστερή πλευρά είναι μεγαλύτερη από δεξιά. \ n " ) ? 
    }
 
    / / Λιγότερο από 
    int c = strcmp ( εγχόρδων, "Γεια σας κόσμο!" ) ? 
    αν  ( γ <=  - 1 )  { 
        printf ( "Αριστερή πλευρά είναι μικρότερη από δεξιά. \ n " ) ? 
    } 
}