#include <iostream>
#include <string.h>
using namespace std;
int main()
{
int i, n, k; n = 0; char c[100];
cout << "Уведіть рядок:" << endl;
cin >> c[ n ]; // уводиться перший символ рядка
while (c[n]='!') // умова вводу символів, доки не зустірнеться ‘!’
{
n++; // лічильник збільшується на одиницю
cin >> c[ n ]; // уводиться наступний символ
}
k = 0; // початкове значення кількості символів ‘о’
for (i = 0;i < n;i++) // відкриваємо цикл для перебору елементів
{
if (c[ i ] == 'o') // якщо поточний елемент матриці = ‘о’,
k++; // кількість збільшується на одиницю
}
// вивід результатів 
if ( k == 0 )
cout << "Немає символів ‘о’ " << endl;
else
 

cout <<"Кількість символів ‘о’ = "<< k << endl;
return 0;
}