# Включити <iostream> 
структура Порожній { } ; 
структура Біт { непідписаних трохи : 1 ;  } ; 
Int основний ( ) 
{ 
    Порожній електронної ; 
    Біт б ; 
    STD :: соіЬ  <<  "розмір порожнього класу:"      << SizeOf електронної         <<  ' \ п ' 
              <<  "Розмір покажчика:"         << SizeOf і електронної        <<  ' \ п ' 
// << "розмір функції:" << SizeOf (недійсними ()) << '\ п' // компіляції Помилка 
// << "розмір неповного типу:" << SizeOf (INT []) << '\ п' // Помилка компіляції 
// << "розмір бітового поля:" << SizeOf b.bit << ' \ п '// помилка на етапі компіляції 
              <<  "розмір масиву 10 INT:"  << SizeOf ( Int [ 10 ] )  <<  ' \ п ' ; 
}